# Learning Pandas

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns = ['A','B','C'])
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [4]:
df.head()

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [5]:
df.head(2)

   A  B  C
0  1  2  3
1  4  5  6

In [6]:
df.tail(2)

   A  B  C
1  4  5  6
2  7  8  9

In [7]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [8]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [9]:
df.index.tolist()

[0, 1, 2]

In [10]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12]], columns = ['A','B','C'], index = ['x','y','z','w'])
df

    A   B   C
x   1   2   3
y   4   5   6
z   7   8   9
w  10  11  12

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, x to w
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
dtypes: int64(3)
memory usage: 128.0+ bytes

In [12]:
df.describe()

               A          B          C
count   4.000000   4.000000   4.000000
mean    5.500000   6.500000   7.500000
std     3.872983   3.872983   3.872983
min     1.000000   2.000000   3.000000
25%     3.250000   4.250000   5.250000
50%     5.500000   6.500000   7.500000
75%     7.750000   8.750000   9.750000
max    10.000000  11.000000  12.000000

In [13]:
df.nunique()

A    4
B    4
C    4
dtype: int64

In [14]:
df['A'].unique()

array([ 1,  4,  7, 10])

In [15]:
df.shape

(4, 3)

# Loading in Dataframes from Files

In [16]:
coffee = pd.read_csv('./warmup-data/coffee.csv')

In [17]:
coffee.shape

(14, 3)

In [18]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [19]:
results = pd.read_parquet('./data/results.parquet')
results.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,17.0,True,None
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,None
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,32.0,True,None
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,None
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,None

In [20]:
results.shape

(308408, 11)

In [21]:
# Takes time
olympics_data = pd.read_excel('./data/olympics-data.xlsx', sheet_name = 'results')
olympics_data.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,17.0,True,NaN
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,NaN
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,32.0,True,NaN
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,NaN
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,NaN

In [22]:
olympics_data.shape

(308408, 11)

In [23]:
bios = pd.read_csv('./data/bios.csv')
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

# Accessing Data with Pandas

In [24]:
display(coffee.head())

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [25]:
coffee.tail(3)

         Day Coffee Type  Units Sold
11  Saturday       Latte          35
12    Sunday    Espresso          45
13    Sunday       Latte          35

In [26]:
coffee.sample(5)
# coffe.sample(n, random_state= b)  n - number, b - seed number

         Day Coffee Type  Units Sold
11  Saturday       Latte          35
9     Friday       Latte          35
6   Thursday    Espresso          40
2    Tuesday    Espresso          30
1     Monday       Latte          15

In [27]:
coffee.loc[[0,1,5]]

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
5  Wednesday       Latte          25

In [28]:
coffee.loc[3:11:2]

          Day Coffee Type  Units Sold
3     Tuesday       Latte          20
5   Wednesday       Latte          25
7    Thursday       Latte          30
9      Friday       Latte          35
11   Saturday       Latte          35

In [29]:
coffee.loc[10:,['Day','Units Sold']]

         Day  Units Sold
10  Saturday          45
11  Saturday          35
12    Sunday          45
13    Sunday          35

In [30]:
# .iloc method allows to index through columns, but it won't work with column names
coffee.iloc[::5,[1,2]]

   Coffee Type  Units Sold
0     Espresso          25
5        Latte          25
10    Espresso          45

In [31]:
coffee.index = coffee['Day']
coffee

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35
Wednesday  Wednesday       Latte          25
Thursday    Thursday    Espresso          40
Thursday    Thursday       Latte          30
Friday        Friday    Espresso          45
Friday        Friday       Latte          35
Saturday    Saturday    Espresso          45
Saturday    Saturday       Latte          35
Sunday        Sunday    Espresso          45
Sunday        Sunday       Latte          35

In [32]:
coffee.loc["Tuesday":"Friday","Units Sold"]

Day
Tuesday      30
Tuesday      20
Wednesday    35
Wednesday    25
Thursday     40
Thursday     30
Friday       45
Friday       35
Name: Units Sold, dtype: int64

In [33]:
coffee = pd.read_csv('./warmup-data/coffee.csv')
coffee.loc[1:7:2,'Units Sold'] = 1000
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte        1000
2     Tuesday    Espresso          30
3     Tuesday       Latte        1000
4   Wednesday    Espresso          35
5   Wednesday       Latte        1000
6    Thursday    Espresso          40
7    Thursday       Latte        1000
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [34]:
# Returns single value
coffee.at[0,'Units Sold']

np.int64(25)

In [35]:
coffee.iloc[2,1]

'Espresso'

In [36]:
coffee["Day"].head()

0       Monday
1       Monday
2      Tuesday
3      Tuesday
4    Wednesday
Name: Day, dtype: object

In [37]:
# We can access column if it's name is one word
coffee.Day

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

In [38]:
coffee.sort_values(['Units Sold', 'Day'] ,ascending = [0,1])
# sorts by Units sold Descending and by name of Day in lexicographical Ascending

          Day Coffee Type  Units Sold
1      Monday       Latte        1000
7    Thursday       Latte        1000
3     Tuesday       Latte        1000
5   Wednesday       Latte        1000
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
4   Wednesday    Espresso          35
2     Tuesday    Espresso          30
0      Monday    Espresso          25

In [39]:
# Not the most effective from performance standpoint
for index, row in coffee.iterrows():
    print(index)
    print(row["Units Sold"])
    print("\n")

0
25


1
1000


2
30


3
1000


4
35


5
1000


6
40


7
1000


8
45


9
35


10
45


11
35


12
45


13
35

# Filtering Data

In [40]:
bios.tail()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [41]:
bios.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
dtypes: float64(2), int64(1), object(7)
memory usage: 11.1+ MB

In [42]:
bios.loc[bios['height_cm']>= 220, ['name', 'height_cm']]

                      name  height_cm
5089    Viktor Pankrashkin      220.0
5673        Gunther Behnke      221.0
5781        Tommy Burleson      223.0
6504           Luc Longley      220.0
6978       Arvydas Sabonis      223.0
7188    Vladimir Tkachenko      220.0
89070             Yao Ming      226.0
89075       Roberto Dueñas      221.0
120266        Zhang Zhaoxu      221.0

In [43]:
bios[bios['height_cm']>=220][['name','height_cm']]

                      name  height_cm
5089    Viktor Pankrashkin      220.0
5673        Gunther Behnke      221.0
5781        Tommy Burleson      223.0
6504           Luc Longley      220.0
6978       Arvydas Sabonis      223.0
7188    Vladimir Tkachenko      220.0
89070             Yao Ming      226.0
89075       Roberto Dueñas      221.0
120266        Zhang Zhaoxu      221.0

In [44]:
bios[(bios['height_cm'] >= 215) & (bios['born_country'] == 'USA')]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
6722,6755,Shaquille O'Neal,1972-03-06,Newark,New Jersey,USA,United States,216.0,137.0,NaN
6937,6972,David Robinson,1965-08-06,Key West,Florida,USA,United States,216.0,107.0,NaN
123850,126093,Tyson Chandler,1982-10-02,Hanford,California,USA,United States,216.0,107.0,NaN

In [45]:
bios[bios['name'].str.contains('Oleg |Roman ')]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
2794,2806,Oleg Ogorodov,1972-07-16,Toshkent,Toshkent Shahri,UZB,Uzbekistan,193.0,87.0,NaN
7726,7767,Roman Rożek,1942-08-05,Busko-Zdrój,Świętokrzyskie,POL,Poland,158.0,51.0,NaN
7980,8021,Oleg Saitov,1974-05-26,Zhigulevsk,Samara,RUS,Russian Federation,178.0,69.0,NaN
8449,8496,Oleg Grigoryev,1937-12-25,Moskva (Moscow),Moskva,RUS,Soviet Union,156.0,54.0,NaN
8479,8526,Oleg Nikolayev,1968-04-10,Magadan,Magadan,RUS,Unified Team,173.0,63.0,1999-11-27
...,...,...,...,...,...,...,...,...,...,...
142620,146233,Oleg Gusev,1996-04-24,Ryazan,Ryazan,RUS,ROC,NaN,NaN,NaN
143048,146680,Roman Mityukov,2000-07-30,NaN,NaN,NaN,Switzerland,NaN,NaN,NaN
144504,148196,Roman Will,1992-05-22,Plzeň,Plzeňský kraj,CZE,Czechia,181.0,NaN,NaN
144694,148393,Roman Rees,1993-03-01,Freiburg im Breisgau,Baden-Württemberg,GER,Germany,NaN,NaN,NaN
145138,148855,Roman Trofimov,1989-11-19,Leninogorsk,Respublika Tatarstan,RUS,ROC,NaN,NaN,NaN

In [46]:
bios[bios['born_city'].isin(['Grozny','Makhachkala'])]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
2096,2106,Makhlukhanum Murzayeva,1966-10-04,Makhachkala,Respublika Dagestan,RUS,Russian Federation,NaN,NaN,NaN
8486,8533,Yury Radonyak,1935-10-08,Grozny,Chechenskaya Respublika,RUS,Soviet Union,167.0,59.0,2013-03-28
8493,8540,Ramzan Sebiyev,1969-10-26,Grozny,Chechenskaya Respublika,RUS,Soviet Union,180.0,91.0,NaN
8496,8543,Nurmagomed Shanavazov,1965-02-19,Makhachkala,Respublika Dagestan,RUS,Soviet Union,185.0,81.0,NaN
8509,8556,Ruslan Taramov,1965-07-13,Grozny,Chechenskaya Respublika,RUS,Soviet Union,180.0,75.0,NaN
23406,23587,Vladimir Nazlymov,1945-11-01,Makhachkala,Respublika Dagestan,RUS,Soviet Union,176.0,73.0,NaN
29002,29216,Lyudmila Turishcheva,1952-10-07,Grozny,Chechenskaya Respublika,RUS,Soviet Union,160.0,52.0,NaN
31023,31259,Vladimir Marchenko,1952-09-22,Grozny,Chechenskaya Respublika,RUS,Soviet Union,169.0,63.0,NaN
31035,31271,Vladimir Tikhonov,1956-10-31,Grozny,Chechenskaya Respublika,RUS,Soviet Union,169.0,61.0,NaN
33152,33403,Magomedbek Aliyev,1967-05-14,Makhachkala,Respublika Dagestan,RUS,Unified Team,NaN,NaN,NaN
33792,34054,Islam Matsiyev,1973-12-10,Grozny,Chechenskaya Respublika,RUS,Russian Federation,168.0,66.0,NaN
34227,34492,Bashir Varayev,1964-02-23,Grozny,Chechenskaya Respublika,RUS,Soviet Union,178.0,78.0,NaN
34228,34493,Sharip Varayev,1969-08-13,Grozny,Chechenskaya Respublika,RUS,Unified Team,NaN,NaN,NaN
56487,56890,Israil Arsamakov,1962-02-08,Grozny,Chechenskaya Respublika,RUS,Soviet Union,169.0,85.0,NaN
56854,57259,Məmmədsalam Haciyev,1972-07-08,Makhachkala,Respublika Dagestan,RUS,Azerbaijan Unified Team,178.0,77.0,NaN
56856,57261,Davud Məhəmmədov,1970-11-08,Makhachkala,Respublika Dagestan,RUS,Azerbaijan,182.0,97.0,2005-06-07
59429,59855,Magomed Azizov,1969-05-12,Makhachkala,Respublika Dagestan,RUS,Russian Federation Unified Team,165.0,62.0,NaN
59446,59872,Khadzhimurat Magomedov,1974-02-24,Makhachkala,Respublika Dagestan,RUS,Russian Federation,178.0,82.0,NaN
60013,60445,Ruslan Ashuraliyev,1950-02-20,Makhachkala,Respublika Dagestan,RUS,Soviet Union,174.0,74.0,2009-11-27
76559,77147,Tatyana Anisimova,1949-10-19,Grozny,Chechenskaya Respublika,RUS,Soviet Union,172.0,65.0,NaN
76735,77324,Valentina Tikhomirova,1941-06-28,Makhachkala,Respublika Dagestan,RUS,Soviet Union,173.0,65.0,NaN
87768,88469,Svetlana Lapina,1978-04-12,Makhachkala,Respublika Dagestan,RUS,Russian Federation,180.0,58.0,NaN
94255,95016,Bieybulat Musayeu,1977-08-08,Makhachkala,Respublika Dagestan,RUS,Belarus,182.0,85.0,NaN
94395,95158,Nasir Gadžihanov,1967-02-16,Makhachkala,Respublika Dagestan,RUS,North Macedonia,175.0,76.0,2012-05-29
105150,106184,Khavazhi Khatsihau,1977-04-17,Grozny,Chechenskaya Respublika,RUS,Belarus,168.0,54.0,NaN
106919,108033,Yusup Abdusalomov,1977-11-08,Makhachkala,Respublika Dagestan,RUS,Tajikistan,170.0,84.0,NaN
106929,108044,Sihamir Osmanov,1975-03-25,Makhachkala,Respublika Dagestan,RUS,North Macedonia,172.0,74.0,NaN
106959,108075,Kuramagomed Kuramagomedov,1978-03-21,Makhachkala,Respublika Dagestan,RUS,Russian Federation,177.0,120.0,NaN
106964,108081,Marid Mutalimov,1980-02-22,Makhachkala,Respublika Dagestan,RUS,Kazakhstan,187.0,120.0,NaN
107012,108132,Shamil Aliyev,1979-09-09,Makhachkala,Respublika Dagestan,RUS,Tajikistan,173.0,84.0,NaN
112971,114258,Krasimir Gaydarski,1983-02-23,Grozny,Chechenskaya Respublika,RUS,Bulgaria,204.0,98.0,NaN
114367,115675,Yuliya Yefimova,1992-04-03,Grozny,Chechenskaya Respublika,RUS,ROC Russian Federation,178.0,64.0,NaN
115676,117041,Rizvan Hadzhieu,1987-01-06,Makhachkala,Respublika Dagestan,RUS,Belarus,165.0,55.0,NaN
115697,117063,Ramazan Şahin,1983-07-08,Makhachkala,Respublika Dagestan,RUS,Türkiye,170.0,66.0,NaN
115761,117128,Əli İsayev,1983-12-18,Makhachkala,Respublika Dagestan,RUS,Azerbaijan,187.0,120.0,NaN
115786,117153,Islam-Beka Albiyev,1988-12-28,Grozny,Chechenskaya Respublika,RUS,Russian Federation,165.0,66.0,NaN
118631,120367,Abdusalam Gadisov,1989-03-26,Makhachkala,Respublika Dagestan,RUS,Russian Federation,178.0,84.0,NaN
119147,120932,Hajimurad Nurmagomedov,1987-05-01,Makhachkala,Respublika Dagestan,RUS,Armenia,173.0,84.0,NaN
119612,121436,Camaləddin Maqomedov,1989-03-14,Makhachkala,Respublika Dagestan,RUS,Azerbaijan,186.0,125.0,NaN
119774,121607,Məhəmməd Əbdülhəmidov,1986-11-16,Makhachkala,Respublika Dagestan,RUS,Azerbaijan,167.0,56.0,NaN
121530,123524,Zelimkhon Yusufov,1984-02-19,Makhachkala,Respublika Dagestan,RUS,Tajikistan,174.0,66.0,NaN
126735,129113,Patimat Abakarova,1994-10-23,Makhachkala,Respublika Dagestan,RUS,Azerbaijan,165.0,49.0,NaN
130080,132734,Amarhadhy Mahamedau,1990-04-12,Makhachkala,Respublika Dagestan,RUS,Belarus,184.0,88.0,NaN
130345,133025,Arthur Biyarslanov,1995-04-22,Makhachkala,Respublika Dagestan,RUS,Canada,174.0,64.0,NaN
132842,135750,Adlan Abdurashidov,1990-07-31,Grozny,Chechenskaya Respublika,RUS,Russian Federation,172.0,60.0,NaN
132916,135826,Anzor Boltukayev,1986-04-05,Grozny,Chechenskaya Respublika,RUS,Russian Federation,180.0,97.0,NaN
139897,143390,Hamsat Shadalov,1998-10-14,Grozny,Chechenskaya Respublika,RUS,Germany,NaN,NaN,NaN
142562,146174,Darya Semyanova,2002-08-13,Makhachkala,Respublika Dagestan,RUS,ROC,NaN,NaN,NaN

# Adding/Removing Columns

In [47]:
import numpy as np

In [48]:
coffee = pd.read_csv('./warmup-data/coffee.csv')
coffee['price'] = 4.99
coffee.head()

         Day Coffee Type  Units Sold  price
0     Monday    Espresso          25   4.99
1     Monday       Latte          15   4.99
2    Tuesday    Espresso          30   4.99
3    Tuesday       Latte          20   4.99
4  Wednesday    Espresso          35   4.99

In [49]:
coffee['new_price'] = np.where(coffee['Coffee Type'] == 'Espresso', 3.99, 5.99)
coffee.head()

         Day Coffee Type  Units Sold  price  new_price
0     Monday    Espresso          25   4.99       3.99
1     Monday       Latte          15   4.99       5.99
2    Tuesday    Espresso          30   4.99       3.99
3    Tuesday       Latte          20   4.99       5.99
4  Wednesday    Espresso          35   4.99       3.99

In [50]:
coffee.drop(columns= ['price']).head()

         Day Coffee Type  Units Sold  new_price
0     Monday    Espresso          25       3.99
1     Monday       Latte          15       5.99
2    Tuesday    Espresso          30       3.99
3    Tuesday       Latte          20       5.99
4  Wednesday    Espresso          35       3.99

In [51]:
# drop method didn't modify the table, but returns one
coffee.head()

         Day Coffee Type  Units Sold  price  new_price
0     Monday    Espresso          25   4.99       3.99
1     Monday       Latte          15   4.99       5.99
2    Tuesday    Espresso          30   4.99       3.99
3    Tuesday       Latte          20   4.99       5.99
4  Wednesday    Espresso          35   4.99       3.99

In [52]:
# we need to use inplace = True to modify it
coffee.drop(columns = ['price'], inplace = True)

In [53]:
coffee.head()

         Day Coffee Type  Units Sold  new_price
0     Monday    Espresso          25       3.99
1     Monday       Latte          15       5.99
2    Tuesday    Espresso          30       3.99
3    Tuesday       Latte          20       5.99
4  Wednesday    Espresso          35       3.99

In [54]:
coffee['revenue'] = coffee['Units Sold'] * coffee['new_price']
coffee.rename(columns={'new_price':'price'}, inplace = True)
coffee.head()

         Day Coffee Type  Units Sold  price  revenue
0     Monday    Espresso          25   3.99    99.75
1     Monday       Latte          15   5.99    89.85
2    Tuesday    Espresso          30   3.99   119.70
3    Tuesday       Latte          20   5.99   119.80
4  Wednesday    Espresso          35   3.99   139.65

In [55]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [56]:
bios_new = bios.copy()
bios_new['first_name'] = bios_new['name'].str.split().str[0]
bios_new.query('first_name == "Andrew"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
81,82,Andrew Castle,1963-11-15,Epsom,England,GBR,Great Britain,190.0,74.0,NaN,Andrew
759,763,Andrew Sznajder,1967-05-25,Preston,England,GBR,Canada,180.0,72.0,NaN,Andrew
1467,1474,Andrew McNally,1973-12-03,Perth,Western Australia,AUS,Australia,178.0,76.0,NaN,Andrew
1470,1477,Andrew Scott,1969-12-22,Adelaide,South Australia,AUS,Australia,176.0,80.0,NaN,Andrew
2038,2048,Andrew Lindsay,1976-05-09,Auckland,Auckland,NZL,New Zealand,NaN,NaN,NaN,Andrew
...,...,...,...,...,...,...,...,...,...,...,...
143781,147437,Andrew Reed,1991-12-19,Worcester,Massachusetts,USA,United States,191.0,89.0,NaN,Andrew
143808,147464,Andrew Seliskar,1996-09-26,NaN,NaN,NaN,United States,NaN,NaN,NaN,Andrew
143809,147465,Andrew Wilson,1993-09-16,NaN,NaN,NaN,United States,NaN,NaN,NaN,Andrew
145437,149160,Andrew Blaser,1989-05-08,Meridian,Idaho,USA,United States,NaN,NaN,NaN,Andrew
145447,149170,Andrew Heo,2001-03-07,NaN,NaN,NaN,United States,NaN,NaN,NaN,Andrew

In [57]:
bios_new['born_datetime'] = pd.to_datetime(bios_new['born_date'])
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,born_datetime
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François,1886-12-12
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17

In [58]:
bios_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 12 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   athlete_id     145500 non-null  int64
 1   name           145500 non-null  object
 2   born_date      143693 non-null  object
 3   born_city      110908 non-null  object
 4   born_region    110908 non-null  object
 5   born_country   110908 non-null  object
 6   NOC            145499 non-null  object
 7   height_cm      106651 non-null  float64
 8   weight_kg      102070 non-null  float64
 9   died_date      33940 non-null   object
 10  first_name     145500 non-null  object
 11  born_datetime  143693 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(1), object(8)
memory usage: 13.3+ MB

In [59]:
bios_new['born_year'] = bios_new['born_datetime'].dt.year
bios_new[['name','born_year']]

                         name  born_year
0       Jean-François Blanchy     1886.0
1              Arnaud Boetsch     1969.0
2                Jean Borotra     1898.0
3             Jacques Brugnon     1895.0
4                Albert Canet     1878.0
...                       ...        ...
145495      Polina Luchnikova     2002.0
145496    Valeriya Merkusheva     1999.0
145497        Yuliya Smirnova     1998.0
145498         André Foussard     1899.0
145499          Bill Phillips     1913.0

[145500 rows x 2 columns]

In [60]:
bios_new.to_csv('./data/bios_new.csv',index = False)

In [61]:
bios['height_category'] = bios['height_cm'].apply(lambda x: 'Short' if x < 165 else ('Average' if x < 185 else 'Tall'))
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Tall
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Tall

In [62]:
def categorize_athlete(row):
    if row['height_cm'] < 175 or row['weight_kg'] < 70:
        return 'Lightweight'
    elif row['height_cm'] < 185 or row['weight_kg'] < 80:
        return 'Middleweight'
    else:
        return 'Heavyweight'

# axis = 0 - affects columns
# axis = 1 - affects rows
bios['Category'] = bios.apply(categorize_athlete, axis = 1)

bios.head()j

SyntaxError: invalid syntax (1361662575.py, line 13)

# Merging & Concatenating Data

In [ ]:
bios = pd.read_csv('./data/bios.csv')
nocs = pd.read_csv('./data/noc_regions.csv')
nocs

In [ ]:
bios.head()

In [ ]:
bios_new = pd.merge(bios, nocs, left_on='born_country', right_on = 'NOC', how = 'left') 
# how = left/inner/right/full - like in sql

In [ ]:
bios_new.rename(columns = {'region': 'born_country_full'}, inplace=True)

In [ ]:
bios_new.head()

In [ ]:
bios_new[bios_new['NOC_x'] != bios_new['born_country_full']][['NOC_x','born_country_full']]

In [ ]:
usa = bios[bios['born_country'] == 'USA'].copy()
gbr = bios[bios['born_country'] == 'GBR'].copy()

In [ ]:
usa.head()

In [ ]:
gbr.head()

In [ ]:
new_df = pd.concat([usa,gbr])
new_df.sample(10)

In [ ]:
results.head()

In [ ]:
combined_df = pd.merge(results, bios, on='athlete_id', how = 'left')

In [ ]:
combined_df.head()

# Handling Null Values

In [ ]:
coffee.head()

In [ ]:
coffee.loc[[0,1], 'Units Sold'] = np.nan
coffee.head()

In [ ]:
coffee.isna().sum()

In [ ]:
coffee.fillna(10000)

In [ ]:
coffee.fillna(coffee['Units Sold'].mean())

In [ ]:
coffee.dropna()

In [ ]:
coffee[coffee['Units Sold'].notna()]

# Aggregating Data

In [63]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Tall
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Tall

In [64]:
bios['born_city'].value_counts()

born_city
Budapest           1378
Moskva (Moscow)     883
Oslo                708
Stockholm           629
Praha (Prague)      600
                   ...
Kirovgrad             1
Pereiaslav            1
Podgornyy             1
Kudepsta              1
Furmanov              1
Name: count, Length: 22368, dtype: int64

In [65]:
bios[bios['born_country'] == 'USA']['born_region'].value_counts()

born_region
California              1634
New York                 990
Illinois                 585
Massachusetts            530
Pennsylvania             530
New Jersey               381
Texas                    368
Minnesota                365
Ohio                     328
Michigan                 319
Washington               240
Florida                  235
Wisconsin                209
Colorado                 207
Connecticut              156
Indiana                  150
Oregon                   132
Georgia                  129
Virginia                 121
Maryland                 117
District of Columbia     107
Iowa                     102
Hawaiʻi                   95
Kansas                    94
Oklahoma                  93
Louisiana                 92
Utah                      91
Missouri                  91
North Carolina            86
Arizona                   83
New Hampshire             83
Vermont                   68
Mississippi               66
Alabama                   64
Kentucky                  62
Tennessee                 62
Nebraska                  60
Rhode Island              56
Montana                   55
Maine                     50
South Carolina            50
Alaska                    45
Arkansas                  42
Idaho                     41
New Mexico                38
Nevada                    36
South Dakota              27
West Virginia             24
Delaware                  22
North Dakota              16
Wyoming                   14
Name: count, dtype: int64

In [66]:
coffee

          Day Coffee Type  Units Sold  price  revenue
0      Monday    Espresso          25   3.99    99.75
1      Monday       Latte          15   5.99    89.85
2     Tuesday    Espresso          30   3.99   119.70
3     Tuesday       Latte          20   5.99   119.80
4   Wednesday    Espresso          35   3.99   139.65
5   Wednesday       Latte          25   5.99   149.75
6    Thursday    Espresso          40   3.99   159.60
7    Thursday       Latte          30   5.99   179.70
8      Friday    Espresso          45   3.99   179.55
9      Friday       Latte          35   5.99   209.65
10   Saturday    Espresso          45   3.99   179.55
11   Saturday       Latte          35   5.99   209.65
12     Sunday    Espresso          45   3.99   179.55
13     Sunday       Latte          35   5.99   209.65

In [72]:
coffee.groupby('Coffee Type')['Units Sold'].sum()

Coffee Type
Espresso    265
Latte       195
Name: Units Sold, dtype: int64

In [74]:
coffee.groupby('Coffee Type').agg({'Units Sold':'sum', 'price': 'mean'})

             Units Sold  price
Coffee Type
Espresso            265   3.99
Latte               195   5.99

In [84]:
pivot = coffee.pivot(columns='Coffee Type', index='Day', values='revenue')
pivot

Coffee Type  Espresso   Latte
Day
Friday         179.55  209.65
Monday          99.75   89.85
Saturday       179.55  209.65
Sunday         179.55  209.65
Thursday       159.60  179.70
Tuesday        119.70  119.80
Wednesday      139.65  149.75

In [85]:
pivot.sum(axis=1)

Day
Friday       389.2
Monday       189.6
Saturday     389.2
Sunday       389.2
Thursday     339.3
Tuesday      239.5
Wednesday    289.4
dtype: float64

In [86]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Tall
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Tall

In [97]:
bios['born_date'] = pd.to_datetime(bios['born_date'])
bios.groupby(bios['born_date'].dt.year)['name'].count().reset_index().sort_values('name', ascending=False)

     born_date  name
139     1972.0  2231
152     1985.0  2227
140     1973.0  2216
138     1971.0  2205
137     1970.0  2174
..         ...   ...
4       1837.0     1
2       1833.0     1
6       1839.0     1
12      1845.0     1
176     2009.0     1

[177 rows x 2 columns]

In [100]:
bios['year_born'] = bios['born_date'].dt.year
bios['month_born'] = bios['born_date'].dt.month

bios.groupby([bios['year_born'], bios['month_born']])['name'].count().reset_index().sort_values('name', ascending = False)

      year_born  month_born  name
1437     1970.0         1.0   239
1461     1972.0         1.0   229
1497     1975.0         1.0   227
1629     1986.0         1.0   227
1617     1985.0         1.0   225
...         ...         ...   ...
1877     2006.0        12.0     1
1871     2006.0         3.0     1
20       1846.0         7.0     1
21       1846.0         8.0     1
22       1846.0         9.0     1

[1885 rows x 3 columns]

# Advanced Functionality

In [104]:
coffee['yesterday_revenue'] = coffee['revenue'].shift(2)
coffee

          Day Coffee Type  Units Sold  price  revenue  yesterday_revenue
0      Monday    Espresso          25   3.99    99.75                NaN
1      Monday       Latte          15   5.99    89.85                NaN
2     Tuesday    Espresso          30   3.99   119.70              99.75
3     Tuesday       Latte          20   5.99   119.80              89.85
4   Wednesday    Espresso          35   3.99   139.65             119.70
5   Wednesday       Latte          25   5.99   149.75             119.80
6    Thursday    Espresso          40   3.99   159.60             139.65
7    Thursday       Latte          30   5.99   179.70             149.75
8      Friday    Espresso          45   3.99   179.55             159.60
9      Friday       Latte          35   5.99   209.65             179.70
10   Saturday    Espresso          45   3.99   179.55             179.55
11   Saturday       Latte          35   5.99   209.65             209.65
12     Sunday    Espresso          45   3.99   179.55             179.55
13     Sunday       Latte          35   5.99   209.65             209.65

In [105]:
coffee['pct_change'] = 100*coffee['revenue'] / coffee['yesterday_revenue'] 
coffee

,Day,Coffee Type,Units Sold,price,revenue,yesterday_revenue,pct_change
0,Monday,Espresso,25,3.99,99.75,NaN,NaN
1,Monday,Latte,15,5.99,89.85,NaN,NaN
2,Tuesday,Espresso,30,3.99,119.70,99.75,120.000000
3,Tuesday,Latte,20,5.99,119.80,89.85,133.333333
4,Wednesday,Espresso,35,3.99,139.65,119.70,116.666667
5,Wednesday,Latte,25,5.99,149.75,119.80,125.000000
6,Thursday,Espresso,40,3.99,159.60,139.65,114.285714
7,Thursday,Latte,30,5.99,179.70,149.75,120.000000
8,Friday,Espresso,45,3.99,179.55,159.60,112.500000
9,Friday,Latte,35,5.99,209.65,179.70,116.666667
10,Saturday,Espresso,45,3.99,179.55,179.55,100.000000
11,Saturday,Latte,35,5.99,209.65,209.65,100.000000
12,Sunday,Espresso,45,3.99,179.55,179.55,100.000000
13,Sunday,Latte,35,5.99,209.65,209.65,100.000000

In [106]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,year_born,month_born
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Tall,1886.0,12.0
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average,1969.0,4.0
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average,1898.0,8.0
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average,1895.0,5.0
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Tall,1878.0,4.0

In [112]:
bios['height_rank'] = bios['height_cm'].rank(ascending=False)
bios.sort_values(['height_rank'],ascending=True)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,year_born,month_born,height_rank
89070,89782,Yao Ming,1980-09-12,Xuhui District,Shanghai,CHN,People's Republic of China,226.0,141.0,NaN,Tall,1980.0,9.0,1.0
6978,7013,Arvydas Sabonis,1964-12-19,Kaunas,Kaunas,LTU,Lithuania Soviet Union,223.0,122.0,NaN,Tall,1964.0,12.0,2.5
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN,Tall,1952.0,2.0,2.5
5673,5696,Gunther Behnke,1963-01-19,Leverkusen,Nordrhein-Westfalen,GER,Germany,221.0,114.0,NaN,Tall,1963.0,1.0,5.0
89075,89787,Roberto Dueñas,1975-11-01,Madrid,Madrid,ESP,Spain,221.0,137.0,NaN,Tall,1975.0,11.0,5.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
145490,149217,Sin Ye-Chan,1995-06-13,NaN,NaN,NaN,Republic of Korea,NaN,NaN,NaN,Tall,1995.0,6.0,NaN
145491,149218,Matthew Wepke,1989-12-05,NaN,NaN,NaN,Jamaica,NaN,NaN,NaN,Tall,1989.0,12.0,NaN
145492,149219,Carlos García-Ordóñez,1927-04-24,La Habana (Havana),Ciudad de La Habana,CUB,Cuba,NaN,NaN,2019-11-24,Tall,1927.0,4.0,NaN
145493,149220,Landysh Falyakhova,1998-08-31,Dva Polya Artash,Respublika Tatarstan,RUS,ROC,NaN,NaN,NaN,Tall,1998.0,8.0,NaN
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Tall,1913.0,7.0,NaN

In [113]:
coffee.head()

,Day,Coffee Type,Units Sold,price,revenue,yesterday_revenue,pct_change
0,Monday,Espresso,25,3.99,99.75,NaN,NaN
1,Monday,Latte,15,5.99,89.85,NaN,NaN
2,Tuesday,Espresso,30,3.99,119.70,99.75,120.000000
3,Tuesday,Latte,20,5.99,119.80,89.85,133.333333
4,Wednesday,Espresso,35,3.99,139.65,119.70,116.666667

In [120]:
coffee['cumulative revenue'] = coffee['revenue'].cumsum()
coffee

,Day,Coffee Type,Units Sold,price,revenue,yesterday_revenue,pct_change,cumulative revenue
0,Monday,Espresso,25,3.99,99.75,NaN,NaN,99.75
1,Monday,Latte,15,5.99,89.85,NaN,NaN,189.60
2,Tuesday,Espresso,30,3.99,119.70,99.75,120.000000,309.30
3,Tuesday,Latte,20,5.99,119.80,89.85,133.333333,429.10
4,Wednesday,Espresso,35,3.99,139.65,119.70,116.666667,568.75
5,Wednesday,Latte,25,5.99,149.75,119.80,125.000000,718.50
6,Thursday,Espresso,40,3.99,159.60,139.65,114.285714,878.10
7,Thursday,Latte,30,5.99,179.70,149.75,120.000000,1057.80
8,Friday,Espresso,45,3.99,179.55,159.60,112.500000,1237.35
9,Friday,Latte,35,5.99,209.65,179.70,116.666667,1447.00
10,Saturday,Espresso,45,3.99,179.55,179.55,100.000000,1626.55
11,Saturday,Latte,35,5.99,209.65,209.65,100.000000,1836.20
12,Sunday,Espresso,45,3.99,179.55,179.55,100.000000,2015.75
13,Sunday,Latte,35,5.99,209.65,209.65,100.000000,2225.40

In [127]:
latte = coffee[coffee['Coffee Type'] == 'Latte'].copy()
latte['3day'] = latte['Units Sold'].rolling(3).sum()
latte

,Day,Coffee Type,Units Sold,price,revenue,yesterday_revenue,pct_change,cumulative revenue,3day
1,Monday,Latte,15,5.99,89.85,NaN,NaN,189.6,NaN
3,Tuesday,Latte,20,5.99,119.80,89.85,133.333333,429.1,NaN
5,Wednesday,Latte,25,5.99,149.75,119.80,125.000000,718.5,60.0
7,Thursday,Latte,30,5.99,179.70,149.75,120.000000,1057.8,75.0
9,Friday,Latte,35,5.99,209.65,179.70,116.666667,1447.0,90.0
11,Saturday,Latte,35,5.99,209.65,209.65,100.000000,1836.2,100.0
13,Sunday,Latte,35,5.99,209.65,209.65,100.000000,2225.4,105.0

# New Functionality

In [128]:
pd.__version__

'2.3.3'

In [131]:
results_numpy = pd.read_csv('./data/results.csv')
results_numpy.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,17.0,True,NaN
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,NaN
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,32.0,True,NaN
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,NaN
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,NaN

In [132]:
results_arrow = pd.read_csv('./data/results.csv', engine='pyarrow', dtype_backend='pyarrow')
results_arrow.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,<NA>,17.0,True,<NA>
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,<NA>,False,<NA>
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,<NA>,32.0,True,<NA>
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,<NA>
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,<NA>

In [134]:
results_numpy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 308408 entries, 0 to 308407
Data columns (total 11 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   year        305807 non-null  float64
 1   type        305807 non-null  object
 2   discipline  308407 non-null  object
 3   event       308408 non-null  object
 4   as          308408 non-null  object
 5   athlete_id  308408 non-null  int64
 6   noc         308407 non-null  object
 7   team        121714 non-null  object
 8   place       283193 non-null  float64
 9   tied        308408 non-null  bool
 10  medal       44139 non-null   object
dtypes: bool(1), float64(2), int64(1), object(7)
memory usage: 23.8+ MB

In [135]:
results_arrow.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 308408 entries, 0 to 308407
Data columns (total 11 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   year        305807 non-null  double[pyarrow]
 1   type        305807 non-null  string[pyarrow]
 2   discipline  308407 non-null  string[pyarrow]
 3   event       308408 non-null  string[pyarrow]
 4   as          308408 non-null  string[pyarrow]
 5   athlete_id  308408 non-null  int64[pyarrow]
 6   noc         308407 non-null  string[pyarrow]
 7   team        121714 non-null  string[pyarrow]
 8   place       283193 non-null  double[pyarrow]
 9   tied        308408 non-null  bool[pyarrow]
 10  medal       44139 non-null   string[pyarrow]
dtypes: bool[pyarrow](1), double[pyarrow](2), int64[pyarrow](1), string[pyarrow](7)
memory usage: 37.5 MB

In [137]:
results_numpy['as'].str.contains('Keith')

0         False
1         False
2         False
3         False
4         False
          ...
308403    False
308404    False
308405    False
308406    False
308407    False
Name: as, Length: 308408, dtype: bool

In [138]:
results_arrow['as'].str.contains('Keith')

0         False
1         False
2         False
3         False
4         False
          ...
308403    False
308404    False
308405    False
308406    False
308407    False
Name: as, Length: 308408, dtype: bool[pyarrow]

In [141]:
filtered_bios = bios[(bios['born_region'] == 'New Hampshire') | (bios['born_city'] == 'San Francisco')]
filtered_bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,year_born,month_born,height_rank
6128,6155,Raúl García-Ordóñez,1924-09-15,Littleton,New Hampshire,USA,Cuba,188.0,NaN,2013-05-03,Tall,1924.0,9.0,13590.5
7290,7329,Jim Walsh,1930-08-29,San Francisco,California,USA,United States,193.0,86.0,1976-03-04,Tall,1930.0,8.0,5736.0
8619,8666,George Finnegan,1881-09-28,San Francisco,California,USA,United States,NaN,NaN,1913-02-28,Tall,1881.0,9.0,NaN
8639,8686,Frank Haller,1883-01-06,San Francisco,California,USA,United States,NaN,NaN,1939-04-30,Tall,1883.0,1.0,NaN
10981,11038,DeAnne Hemmens,1964-07-02,San Francisco,California,USA,United States,NaN,NaN,NaN,Tall,1964.0,7.0,NaN